In [2]:
import pandas as pd
column = ['Subin', 'Bimala', 'Raju']
titled_column = {'name': column} # now the column list falss under name
titled_column = {'name': column, 'height': [2.5,3.7,5.4], 'weight': [54, 63, 75]}
data = pd.DataFrame(titled_column)
select_column = data['weight'][2]
select_row = data.iloc[1] # iloc represents row, provide the index of the row you wanna extract
print(select_row)
print(select_column)
print(data)

name      Bimala
height       3.7
weight        63
Name: 1, dtype: object
75
     name  height  weight
0   Subin     2.5      54
1  Bimala     3.7      63
2    Raju     5.4      75

In [3]:
import pandas as pd
column = ['Subin', 'Bimala', 'Raju']
titled_column = {'name': column} # now the column list falss under name
titled_column = {'name': column, 'height': [2.5,3.7,5.4], 'weight': [54, 63, 75]}
data = pd.DataFrame(titled_column)
select_row = data.iloc[1]['weight'] # extract just the weight of 1st index
print(select_row)

63

In [4]:
# manipulate dataframe values
bmi = []
# weight/(height**2)
for i in range(len(data)):
    bmi_index = data['weight'][i]/(data['height'][i]**2)
    bmi.append(bmi_index)
data['bmi'] = bmi
print(data)

     name  height  weight       bmi
0   Subin     2.5      54  8.640000
1  Bimala     3.7      63  4.601899
2    Raju     5.4      75  2.572016

In [5]:
# save dataframe to a file
# index = False removes unnecessary indexing
data.to_csv('bmi.csv', index = False, sep='\t') # use tab as data seperator(default is comma)

In [6]:
import pandas as pd
import sqlite3
connection = sqlite3.connect('students.sqlite3')
data = pd.read_csv('bmi.csv', sep='\t')
sql_data = pd.read_sql('select * from student', connection)
print(sql_data)
print(data)

   id   name    address       college  age gender faculty university  \
0   1    ram  kathmandu          ncit   18      m      IT         TU
1   2  shyam   lalitpur     islington   20      m    CSIT         KU
2   4   sita  kathmandu  ioe pulchowk   24      f      CE         KU
3   3   gita    pokhara          ncit   21      f      SE         KU
4   5   hari  kathmandu  ioe pulchowk   24      m   CIVIL         KU
5   6  madan    pokhara          ncit   21      f      SE         KU
6   7   maya  kathmandu     islington   24      f     BIT         KU

    occupation
0  clg-student
1  clg-student
2  clg-student
3  clg-student
4  clg-student
5  clg-student
6  clg-student
     name  height  weight       bmi
0   Subin     2.5      54  8.640000
1  Bimala     3.7      63  4.601899
2    Raju     5.4      75  2.572016

In [7]:
# if unsure of table names, run the following
tables = pd.read_sql("select name from sqlite_master where type = 'table';", connection)
print(tables)

      name
0  student

In [8]:
print(sql_data.head(2)) # print the first 2 data

   id   name    address    college  age gender faculty university   occupation
0   1    ram  kathmandu       ncit   18      m      IT         TU  clg-student
1   2  shyam   lalitpur  islington   20      m    CSIT         KU  clg-student

In [9]:
print(sql_data.tail())

   id   name    address       college  age gender faculty university  \
2   4   sita  kathmandu  ioe pulchowk   24      f      CE         KU
3   3   gita    pokhara          ncit   21      f      SE         KU
4   5   hari  kathmandu  ioe pulchowk   24      m   CIVIL         KU
5   6  madan    pokhara          ncit   21      f      SE         KU
6   7   maya  kathmandu     islington   24      f     BIT         KU

    occupation
2  clg-student
3  clg-student
4  clg-student
5  clg-student
6  clg-student

In [10]:
import pandas as pd
import sqlite3
connection = sqlite3.connect('students.sqlite3')
data = pd.read_csv('bmi.csv', sep='\t')
sql_data = pd.read_sql('select * from student', connection)
# filter data
filtered_row = sql_data[sql_data['address'] == 'kathmandu'] # access all data where address is kathmandu
print(filtered_row)

   id  name    address       college  age gender faculty university  \
0   1   ram  kathmandu          ncit   18      m      IT         TU
2   4  sita  kathmandu  ioe pulchowk   24      f      CE         KU
4   5  hari  kathmandu  ioe pulchowk   24      m   CIVIL         KU
6   7  maya  kathmandu     islington   24      f     BIT         KU

    occupation
0  clg-student
2  clg-student
4  clg-student
6  clg-student

In [11]:
# replace data
replaced_city = sql_data.replace('kathmandu', 'KTM')
print(replaced_city)

   id   name   address       college  age gender faculty university  \
0   1    ram       KTM          ncit   18      m      IT         TU
1   2  shyam  lalitpur     islington   20      m    CSIT         KU
2   4   sita       KTM  ioe pulchowk   24      f      CE         KU
3   3   gita   pokhara          ncit   21      f      SE         KU
4   5   hari       KTM  ioe pulchowk   24      m   CIVIL         KU
5   6  madan   pokhara          ncit   21      f      SE         KU
6   7   maya       KTM     islington   24      f     BIT         KU

    occupation
0  clg-student
1  clg-student
2  clg-student
3  clg-student
4  clg-student
5  clg-student
6  clg-student

In [12]:
# remove data
remove_column = sql_data.drop('occupation', axis=1)
remove_column = sql_data.drop(['occupation', 'gender'], axis=1) # remove multiple colums using list
remove_row = sql_data.iloc[1:3] # only selects row indices 1 and 2
print(remove_row)
print(remove_column)
''' 
The drop() function can be used to remove:

Rows → axis=0 (default)

Columns → axis=1 (must be explicitly stated)
'''

   id   name    address       college  age gender faculty university  \
1   2  shyam   lalitpur     islington   20      m    CSIT         KU
2   4   sita  kathmandu  ioe pulchowk   24      f      CE         KU

    occupation
1  clg-student
2  clg-student
   id   name    address       college  age faculty university
0   1    ram  kathmandu          ncit   18      IT         TU
1   2  shyam   lalitpur     islington   20    CSIT         KU
2   4   sita  kathmandu  ioe pulchowk   24      CE         KU
3   3   gita    pokhara          ncit   21      SE         KU
4   5   hari  kathmandu  ioe pulchowk   24   CIVIL         KU
5   6  madan    pokhara          ncit   21      SE         KU
6   7   maya  kathmandu     islington   24     BIT         KU

' \nThe drop() function can be used to remove:\n\nRows → axis=0 (default)\n\nColumns → axis=1 (must be explicitly stated)\n'

In [13]:
# add new rows
row = {'name': 'Subin', 'address': 'Finland', 'college': 'CCRC'}
! new_row_data = sql_data.append(row, ignore_index = True) #append only works in older vertions for DF object, use concat instead
# To append, first convert the row to a 1-row DataFrame
new_row_df = pd.DataFrame([row])
# Concatenate with the original DataFrame
new_row_data = pd.concat([sql_data, new_row_df], ignore_index=True) # ignore_index solves duplicated or misaligned indexes. Makes sure the new row fits nicely at the end
print(new_row_data)

zsh:1: unknown sort specifier
    id   name    address       college   age gender faculty university  \
0  1.0    ram  kathmandu          ncit  18.0      m      IT         TU
1  2.0  shyam   lalitpur     islington  20.0      m    CSIT         KU
2  4.0   sita  kathmandu  ioe pulchowk  24.0      f      CE         KU
3  3.0   gita    pokhara          ncit  21.0      f      SE         KU
4  5.0   hari  kathmandu  ioe pulchowk  24.0      m   CIVIL         KU
5  6.0  madan    pokhara          ncit  21.0      f      SE         KU
6  7.0   maya  kathmandu     islington  24.0      f     BIT         KU
7  NaN  Subin    Finland          CCRC   NaN    NaN     NaN        NaN

    occupation
0  clg-student
1  clg-student
2  clg-student
3  clg-student
4  clg-student
5  clg-student
6  clg-student
7          NaN

In [14]:
# Add multiple rows at once
new_rows = [
    {'name': 'Bimala', 'address': 'Riihimaki', 'college': 'Kist'},
    {'name': 'Bimala', 'address': 'Riihimaki', 'college': 'Kist'}
    ]
# Convert new rows to DataFrame and concatenate
rows_updated = pd.concat([sql_data, pd.DataFrame(new_rows)], ignore_index=True)
print(rows_updated)

    id    name    address       college   age gender faculty university  \
0  1.0     ram  kathmandu          ncit  18.0      m      IT         TU
1  2.0   shyam   lalitpur     islington  20.0      m    CSIT         KU
2  4.0    sita  kathmandu  ioe pulchowk  24.0      f      CE         KU
3  3.0    gita    pokhara          ncit  21.0      f      SE         KU
4  5.0    hari  kathmandu  ioe pulchowk  24.0      m   CIVIL         KU
5  6.0   madan    pokhara          ncit  21.0      f      SE         KU
6  7.0    maya  kathmandu     islington  24.0      f     BIT         KU
7  NaN  Bimala  Riihimaki          Kist   NaN    NaN     NaN        NaN
8  NaN  Bimala  Riihimaki          Kist   NaN    NaN     NaN        NaN

    occupation
0  clg-student
1  clg-student
2  clg-student
3  clg-student
4  clg-student
5  clg-student
6  clg-student
7          NaN
8          NaN

In [ ]:
clean_rows = rows_updated.drop_duplicates(subset=['name']) # subset is name of the column from which we'd like to get rid of duplicates
print(clean_rows)

    id    name    address       college   age gender faculty university  \
0  1.0     ram  kathmandu          ncit  18.0      m      IT         TU
1  2.0   shyam   lalitpur     islington  20.0      m    CSIT         KU
2  4.0    sita  kathmandu  ioe pulchowk  24.0      f      CE         KU
3  3.0    gita    pokhara          ncit  21.0      f      SE         KU
4  5.0    hari  kathmandu  ioe pulchowk  24.0      m   CIVIL         KU
5  6.0   madan    pokhara          ncit  21.0      f      SE         KU
6  7.0    maya  kathmandu     islington  24.0      f     BIT         KU
7  NaN  Bimala  Riihimaki          Kist   NaN    NaN     NaN        NaN

    occupation
0  clg-student
1  clg-student
2  clg-student
3  clg-student
4  clg-student
5  clg-student
6  clg-student
7          NaN